const detail = [
  {
    ESFP: {
      h3: "'친화력 갑 주인공 단짝친구'",
      p: '주로 "학원물 영화"에서 많이 등장해요.<br>온 세상 사람들이 모두 내 친구에요.<br>주변 사람들에게 관심이 많고 말도 많은 주인공의 정보통 역할.<br>가끔은 너무 시끄러워서 주인공이 골치 아파 하지만,<br>분위기 메이커 역할을 하기 때문에 미워할 수 없는 캐릭터.',
      resultDesc: [
        '세상 근심 걱정이 없는 편이에요.',
        '현재를 즐기고 낙천적이에요.',
        '혼자 보다는 다 같이 하는 일을 좋아하고, 능률이 좋아요.',
        '엄청난 끼쟁이예요.',
        '도전을 두려워 하기 보다는 즐기는 편이지만, 변덕이 심하고 금방 질려해요.',
        '프로 파티 참석러예요.',
        '개성이 넘치고 패션에 관심이 많아서 본인을 잘 꾸미는 편이에요.',
        '시작은 잘하지만 끝 마무리를 잘 하지 못해요.',
        '성격이 단순해서 힘든 일도 잘 극복해요.',
        '장기적인 계획을 세우는 것을 힘들어해서 임기응변으로 상황을 무마해요.'
      ],
      good: "'소확행 도서관 사서'<br>'일잘러 대리님'",
      bad: "'동영상 크리에이터'<br>'내가 최고 법조인 캐릭터'"
    },
  },
  {
    ESTP: {
      h3: "'폼생폼사 탐정'",
      p: '주로 형사물에 등장하는 멋에 죽고 멋에 사는 탐정 캐릭터예요.<br>본인한테 재미 없는 사건은 맡으려 하지 않고, 멋을 중요시하기 때문에 항상 잘 꾸미고 다녀요.<br>우유부단하고 느린 동료를 보면 속이 터져서, 혼자 사건을 해결하는 경우가 많아요.<br>관찰력이 좋고, 사람 파악을 잘하는 특유의 능력으로 인정 받아요.',
      resultDesc: [
        '새로운 것을 배우고 경험하는 것을 좋아해요.',
        '하고싶은 건 꼭 해야 직성이 풀리지만, 금방 질리곤 해요.',
        '벼락치기가 일상이에요.',
        '공감능력이 좋진 않지만 다정다감해요.',
        '인싸인데 더 인싸인 사람을 만나면 뚝딱거려요.',
        '귀여운 내향인을 간택해서 데리고 다니는 것을 좋아해요.',
        '단순하고 물 흐르듯 살아서 삶의 만족도가 높은 편이에요.',
        '경쟁을 즐기고 승부욕이 강해요.',
        '사람들의 관계를 중요시하고 사교적이에요.',
        '겁이 없어요.',
        '미래에 큰 관심이 없고 지금 할 수 있는 일을 해요.'
      ],
      good: "'소확행 도서관 사서'<br>'일잘러 대리님'",
      bad: "'내가 최고 법조인 캐릭터'<br>'동영상 크리에이터'"
    },
  },
  {
    ENTP: {
      h3: "'내가 최고 법조인 캐릭터'",
      p: '주로 법정 드라마에 나오는 자신감 넘치는 캐릭터에요.<br>기본적으로 자기 확신이 강하고 실제로도 잘하는 것이 많은 만능캐예요.<br>주변 사람들에게 관심이 많고 말도 많은 주인공의 정보통 역할.<br>가끔은 너무 시끄러워서 주인공이 골치 아파 하지만,<br>분위기 메이커 역할을 하기 때문에 미워할 수 없는 캐릭터.',
      resultDesc: [
        '특유의 매력으로 사람들에게 인기가 많아요.',
        '강강약약 스타일이에요.',
        '중요한건 꺾이지 않는 마음? 그런건 몰라요. 그냥 꺾이지 않아요.',
        '노력 대비 결과가 좋은 편이고, 본인도 이를 잘 알고 있어요.',
        '호감가는 사람이 생기면 적극적으로 표현하는 플러팅 장인이에요.',
        '좋아하는 것도 많고 취미도 많아요.',
        '논쟁을 즐기는 편이고, 본인이 이겨야 속이 시원해요. 이 과정에서 누군가에게 상처를 줄 수도 있어요.',
        '호기심이 많아요.',
        '잔 실수가 많고 자주 덤벙 거려요.',
        '관습을 따르는 것을 싫어해서 위계 질서가 강한 조직 생활에는 맞지 않아요.'        
      ],
      good: "'다정다감한 상담선생님'<br>'자기애 충만 기자'",
      bad: "'친화력 갑 주인공 단짝친구'<br>'폼생폼사 탐정'"
    },
  },
  {
    ENFP: {
      h3: "'발랄한 동영상 크리에이터'",
      p: '로맨틱 코미디 장르의 영화에 등장할 것 같은 발랄한 캐릭터에요.<br>엄청난 수다쟁이로, 은근한 개그캐로 자주 등장할 것 같아요.<br>가끔은 과한 텐션 때문에 주변 인물들이 힘들어하지만,<br>늘 긍정적이고 밝은 모습으로 분위기를 띄워주기 때문에<br>결국엔 좋아할 수밖에 없어요.',
      resultDesc: [
        '공감능력이 뛰어나고 친화력이 좋아요.',
        '내향인 수집가예요.',
        '의외로 생각이 많고 감정기복이 심한 편이에요.',
        '관심 받는게 너무 좋은 관종이에요. 사람들이 다 나를 좋아해 줬으면 좋겠어요.',
        '누구에게나 말을 잘 붙이고 친절해서 어르신들도 좋아하는 유형이에요.',
        '겉보기엔 밝지만 은근 예민한 구석이 있어요.',
        '말하는게 너무 좋아요. 친구랑 카페에서 만나면 하루 종일 떠들 수 있어요.',
        '노는게 제일 좋은 뽀로로예요.',
        '집중력이 금방 떨어지는 편이에요.',
        '정이 많고 따뜻한 마음씨를 가졌어요.'
      ],
      good: "'다정다감한 상담선생님'<br>'자기애 충만 기자'",
      bad: "'친화력 갑 주인공 단짝친구'<br>'폼생폼사 탐정'"
    },
  },
  {
    ENFJ: {
      h3: "'인기만점 선생님'",
      p: '학원물에서 등장하는 인기 많은 선생님 캐릭터에요.<br>본업도 잘하고 성격도 좋아서 학생들뿐만 아니라<br>동료 선생님들 사이에서도 평판이 좋아요.',
      resultDesc: [
        '삶을 즐기고, 인생 자체를 긍정적으로 생각해요.',
        '남들에게 잘 해주는 만큼 상처도 잘 받아요.',
        '계획을 세워서 일을 진행시키는 것이 좋아요. 계획대로 되지 않으면 화가 나요.',
        '자기가 좋아하는 사람에겐 엄청 퍼주는 스타일이에요.',
        '한 번 마음먹은 일은 적극적으로 추진하고, 목표 달성을 위해서 애써요.',
        '친구들이 기뻐하는 것을 보면 나도 기뻐요.',
        '혼자보단 여럿이서 하는 단체 생활이 좋아요.',
        '생각보다 귀가 얇아요.',
        '타인의 이야기를 잘 경청해요.',
        '걱정이 많지만 티를 안내서 주변 사람들은 잘 모르는 경우가 많아요.'
      ],
      good: "'고군분투 사회 초년생'<br>'자유로운 영혼 목공방 사장님'",
      bad: "'팔방미인 전교회장'<br>'젊꼰 팀장님 캐릭터'"
    },
  },
  {
    ESFJ: {
      h3: "'팔방미인 전교회장'",
      p: '학원물에서 등장하는 능력치 만렙 전교회장 캐릭터에요.<br>운동이면 운동, 공부면 공부 등 두루두루 다 잘해요.<br>모두를 구해야 한다는 사명감에 사로잡혀 있는 오지라퍼라 부담스러울 때도 있지만,<br>친구들이 무슨 일이 생기면 제일 먼저 나서서 돕는 모습에 주변 사람들이 감동받아요.',
      resultDesc: [
        '사회성, 적응력 모두 좋아서 사회생활을 정말 잘해요.',
        '친구들의 일이라면 모두 발 벗고 나서는 의리파에요.',
        '성실하고 생활력이 강해요.',
        '은근히 완벽주의자예요.',
        '애인이 생기면 소유욕이 장난 아니에요. 표현을 잘 해주는 것을 좋아해요.',
        '사람들의 시선을 많이 의식하지만 가끔은 의식하지 않고 행동하기도 해요.',
        '사람들의 인정과 관심이 좋아요.',
        '내 의견에 반대하거나 부탁을 거절당하면 기분이 상해요.',
        '예의 바른 사람이 좋아요.',
        '주변 지인들에게 격려의 말을 잘 해줘요.'
      ],
      good: "'자유로운 영혼 목공방 사장님'<br>'마이웨이 복서'",
      bad: "'인기만점 선생님'<br>'젊꼰 팀장님 캐릭터'"
    },
  },
  {
    ENTJ: {
      h3: "'내가 최고 워커홀릭 메인 셰프'",
      p: '특유의 추진력과 카리스마를 지닌 메인 셰프 캐릭터에요.<br>한없이 냉철해 보이지만 내 사람들에게는 관대하고 따뜻해서<br>함께 일하는 사람들에게 존경받아요.',
      resultDesc: [
        '무능하고 게으른 것을 싫어해요.',
        '눈치를 왜 보죠? 남들이 뭐라 하든 제가 하고 싶은 대로 살아요.',
        '노력으로 해내지 못하는 일은 없다고 생각해요.',
        '팀플하면 조장은 늘 제 몫이에요. 발표도 척척 해내요.',
        '사실은 나서는 것을 그리 좋아하진 않지만, 남들이 못하니까 어쩔 수 없이 나서는거에요.',
        '반복되는 일상은 지루해요. 늘 새로운 것을 배우고자 해요.',
        '직감이 좋아요.',
        '성질이 급하고 비효율 적인 것은 딱 질색이에요.',
        '친구의 고민이 공감 안될 때가 많아요.',
        '저랑 비슷한 사람에게 끌리는 편이에요.'
      ],
      good: "'고군분투 사회 초년생'<br>'자발적 아싸 약사'",
      bad: "'팔방미인 전교회장'<br>'젊꼰 팀장님 캐릭터'"
    },
  },
  {
    ESTJ: {
      h3: "'젊꼰 팀장님 캐릭터'",
      p: '오피스물에 등장하는 일을 똑 부러지게 잘하는 젊은 팀장님 캐릭터에요.<br>나이는 젊지만 독하리만큼 일을 잘 해내서 초고속 승진했어요.<br>업무에 대한 이야기를 할 때 가장 눈이 반짝반짝하고,<br>일을 완벽히 잘 해냈을 때가 가장 짜릿하고 기분 좋아요.',
      resultDesc: [
        '제 사전에 미루기란 없어요.',
        '늘 바쁘게 살지만, 하고 싶은 것도 많고 배우고 싶은 것도 많아 하루가 너무 짧게 느껴져요.',
        '계획이 틀어져도 상관없어요. 이미 플랜 B도 만들어 놨거든요.',
        '원칙주의자이고 종종 융통성이 없다는 소리를 들어요.',
        '하고 싶은 말은 꼭 해야 해요.',
        '감정적인 사람과는 잘 맞지 않아요.',
        '집안이 늘 깨끗하게 잘 정리 정돈되어 있어요.',
        '자신의 경험을 바탕으로 행동하고, 고정관념이 강해요.',
        '친한 친구가 고민을 이야기할 때 해결책과 계획을 제시해 줘요.'
      ],
      good: "'자유로운 영혼 목공방 사장님'<br>'마이웨이 복서'",
      bad: "'인기만점 선생님'<br>'내가 최고 워커홀릭 메인 셰프'"
    },
  },
  {
    INFP: {
      h3: "'고군분투 사회 초년생'",
      p: '성장물 드라마나 영화에 등장하는 사회 초년생 캐릭터예요.<br>위계질서가 강한 회사 생활에 적응하기 어려워하고, 스트레스를 많이 받아요.<br>하지만 특유의 강한 책임감으로 묵묵히 맡은 일을 해내는 모습을 보면 같이 응원하게 되는 캐릭터예요.',
      resultDesc: [
        '나만의 신념과 가치관이 뚜렷하고 그것을 추구하는데 삶의 큰 의미를 둬요.',
        '공감 능력과 배려심이 좋아서 애늙은이 같다는 소리를 들어요.',
        '계획을 세우기보다는 순간의 감정에 따라 즉흥적으로 행동해요.',
        '뭐든지 완벽하게 해내고 싶은 마음에 금방 무기력해져요.',
        '연락하는 것이 귀찮고 안읽씹을 많이 해요.',
        '때로는 온라인 친구가 더 편해요.',
        '해야 할 일을 끝까지 미뤄요.',
        '우유부단해서 주변 사람들이 가끔은 답답하다고 해요.',
        '여럿이서 노는 것보다는 소수의 사람들과 어울리는 것이 좋아요.',
        '한 번 사랑에 빠지면 깊이 빠지는 편이에요.'        
      ],
      good: "'인기만점 선생님'<br>'내가 최고 워커홀릭 메인 셰프'",
      bad: "'자유로운 영혼 목공방 사장님'<br>'마이웨이 복서'"
    },
  },
  {
    ISFP: {
      h3: "'자유로운 영혼 목공방 사장님'",
      p: '로맨스 코미디 장르에서 등장하는 순둥순둥 순두부 같은 캐릭터예요.<br>순수한 아이 같은 이 캐릭터는 항상 물 흐르듯이 살고<br>매사에 걱정이 없어 보이지만, 알고 보면 나름의 고충은 가지고 있어요.<br>구김살 없는 모습으로 주변 사람들을 편하게 해주고, 인기가 좋아요.',
      resultDesc: [
        '남들은 착하다는데 본인은 어리둥절해요.',
        '현재를 중시하고 장기적인 계획을 세우는 것이 어려워요.',
        '배려는 잘 하지만 개인주의자 성향이 강해요.',
        '관심받고 싶지만 한편으로는 관심받고 싶지 않아요.',
        '수줍음을 많이 타서 첫 이상은 차가워 보이지만 알고 보면 순해요.',
        '전통적으로 내려오는 관습보다는 본인의 가치관에 따라 행동해요.',
        '제 의견을 말하는 게 어려워서 주변에서 답답하다는 소리를 많이 들어요.',
        '뭐든지 ‘그럴 수 있지’라고 생각해요.',
        '발등에 불이 떨어질 때까지 일을 미루지만, 그에 비해 결과는 좋은 편이에요.',
        '혼자가 좋지만 누군가와 함께 있으면 그것대로 또 좋아요.',
        '나가서 노는 건 좋지만 갔다 오면 혼자만의 시간이 필요해요. 약속 연달아 잡는 건 싫어요.'
      ],
      good: "'팔방미인 전교회장'<br>'젊꼰 팀장님 캐릭터'<br>'폼생폼사 탐정'",
      bad: "'고군분투 사회 초년생'<br>'자발적 아싸 약사'"
    },
  },
  {
    INFJ: {
      h3: "'다정다감 상담선생님'",
      p: '고민이 있을 때 찾아가게 되는 다정한 상담 선생님이에요.<br>사람들의 마음을 잘 헤아릴 줄 알고,<br>각각의 사람들에게 알맞은 해결책을 제시해 줘요.<br>힘들 때 많이 의지하게 되는 캐릭터에요.',
      resultDesc: [
        '사람에 따라 성격이 카멜레온 처럼 바뀌어요.',
        '마음을 연 상대에게는 다 퍼주고 싶어요.',
        '다른 사람의 마음을 쉽게 눈치 채지만 모르는 척을 잘 해요.',
        '계획을 짜는 것은 뿌듯한 일이지만, 실행하는 것은 굉장히 귀찮아요.',
        '겉으로는 순해 보이지만 알고 보면 광기 있어요. (반전매력)',
        '사회생활을 잘 하지만, 스스로는 힘들어해요.',
        '구설수에 민감하고 이미지 관리를 중요하게 생각해요.',
        '마음맞는 친구와 단 둘이 노는게 좋아요.',
        '상냥하지만 냉정해요.',
        '생각이 너무 많아서 감당이 안돼요.',
        '상상력이 뛰어나고 창의적이에요.',
        '상대방이 상처 받는게 싫어서 돌려 돌려 말해요.'
      ],
      good: "'발랄한 동영상 크리에이터'<br>'내가 최고 법조인 캐릭터'",
      bad: "'소확행 도서관 사서'<br>'일잘러 대리님'"
    },
  },
  {
    ISFJ: {
      h3: "'소확행 도서관 사서'",
      p: '세심하고 배려심 넘치는 성격으로<br>손님들이 필요로 하는 것을 잘 캐치해요.<br>반복되는 일상 속에서 소소한 행복을 즐기며 살아요.',
      resultDesc: [
        '어른들에게 평판이 좋아요.',
        '사람들 앞에 나서는 것을 싫어해요. 발표는 극혐이에요.',
        '쓸데없는 걱정을 많이 하지만 금방 까먹어요.',
        '칭찬해 주면 좋지만 막상 받으면 부끄러워서 어쩔 줄 모르겠어요.',
        '몽상 같은 건 왜 하는지 모르겠어요.',
        '깊고 좁은 인간관계를 가지고 있어요.',
        '조용해 보이지만 친한 사람들 앞에서는 수다쟁이에요.',
        '튀는 것을 좋아하지 않아서 옷도 예쁘지만 평범한 걸로 사서 입어요.',
        '싸고 질 좋은 물건을 잘 골라요.',
        '세심해서 주변 사람을 잘 챙겨요.',
        '새로운 일에 도전하는 것을 좋아하지 않아요.',
        '친한 친구에게도 속마음을 잘 털어놓지 않아요.',
        '정말 좋아하는 사람이 아니면 전화하는 것을 선호하지 않아요.'
      ],
      good: "'친화력 갑 주인공 단짝친구'<br>'폼생폼사 탐정'",
      bad: "'소확행 도서관 사서'<br>'자기애 충만 기자'"
    },
  },
  {
    INTP: {
      h3: "'자발적 아싸 약사'",
      p: '논리적이고 지적인 모습이 매력적인 캐릭터에요.<br>뭐든 혼자 하는 게 편해서 자발적으로 혼자 지내요.<br>과묵한 편이라 친해지기 어려워 보이지만 알고 보면 털털하고 좋아하는 사람에겐 헌신적이에요.',
      resultDesc: [
        '지적 호기심이 많고 똑똑한 사람이 좋아요.',
        '빈말을 못하고 직설적이에요.',
        '인간을 좋아하진 않지만 흥미로운 존재라고 생각해요.',
        '사차원이라는 소리를 자주 들어요.',
        '친구들이랑 만났을 때 가벼운 이야기를 나누는 것을 좋아하지 않아요. 주제가 있는 대화가 좋아요.',
        '엄청 게으르고 미룰 수 있을 때까지 미루는 편이에요.',
        '추리하고 분석하는 것을 좋아해요.',
        '어지간한 일로 상처는 잘 안 받아요.',
        '혼자 일하고 혼자 노는 게 좋아요.',
        '굉장히 털털해요.',
        '아이디어는 좋으나 행동으로 실천하는 게 어려워요.',
        '추리소설을 좋아해요.'
      ],
      good: "'내가 최고 워커홀릭 메인 셰프'<br>'젊꼰 팀장님 캐릭터'",
      bad: "'자유로운 영혼 목공방 사장님'<br>'마이웨이 복서'"
    },
  },
  {
    ISTP: {
      h3: "'마이웨이 복서'",
      p: '액션 영화에 등장할 것 같은 복서 캐릭터예요.<br>다른 사람에게 무관심하고 본인의 일에만 몰두하는 모습이 냉철해 보일 수 있지만,<br>누구보다 본업을 잘 하는 모습이 매력적이에요.<br>평소엔 차가운 이미지이지만 자기 사람에게는 장난도 잘 치고 개구쟁이같이 행동하기도 해요.',
      resultDesc: [
        '고집이 세고 하고 싶은 건 꼭 해야해요.',
        '효율성을 엄청 따져요. 노력 대비 결과가 좋아요.',
        '이것저것 해보고 싶은 게 많은데 끝맺음을 못해요.',
        '무언가를 분해하고 조립하는 것을 좋아해요.',
        '쓸데없는 걱정은 잘 안 하고 현재를 충실히 살아요.',
        '사람들에게 관심이 없어요.',
        '누군가에게 간섭 받는 것을 굉장히 싫어해요.',
        '모험과 새로운 경험을 하는 것을 좋아해요.',
        '다른 사람의 느린 진행에 답답함을 느껴요.',
        '이야기를 들을 때 결론부터 듣고 싶어요.',
        '객관적이고 현실적인 관점을 가지고 있어 감정에 휘둘리지 않고 판단해요.'
      ],
      good: "'팔방미인 전교회장'<br>'젊꼰 팀장님 캐릭터'",
      bad: "'고군분투 사회 초년생'<br>'자발적 아싸 약사'"
    },
  },
  {
    INTJ: {
      h3: "'자기애 충만 기자'",
      p: '스스로의 능력을 믿고, 언제나 자신감 넘치는 본업 잘하는 기자 캐릭터에요.<br>일을 할 때 엄청난 집중력으로 세세하게 파고들어 특종을 자주 건지곤 해요.<br>이렇게 철두철미하지만 본인이 틀린 것을 확인하게 되면 그 또한 빠르게 인정하는 쿨남&쿨녀 랍니다.',
      resultDesc: [
        '해결해야 할 문제가 있을 때 놀라운 집중력을 보여줘요.',
        '요즘 유행하는 것에 관심이 없어요.',
        '결정을 내릴 땐 단순히 감으로 결정하지 않아요.',
        '돌려 말하는 것을 잘 못해요. 솔직한 게 최고예요.',
        '인간관계 맺는 게 어려워요.',
        '사람을 잘 분석하고, 눈치가 굉장히 빨라요.',
        '자신만의 분야가 확고하고, 그 분야에서만큼은 전문가 못지 않아요.',
        '불확실한 것이 싫어요. 통제와 질서가 있는 세상이 좋아요.',
        '솔직히 스스로 능력이 뛰어나다고 생각해요.',
        '애매한 건 딱 질색이에요.',
        '계획을 완벽하게 짠 후에 행동으로 실행해요.'
      ],
      good: "'동영상 크리에이터'<br>'내가 최고 법조인 캐릭터'",
      bad: "'소확행 도서관 사서'<br>'일잘러 대리님'"
    },
  },
  {
    ISTJ: {
      h3: "'일잘러 대리님'",
      p: '책임감이 강하고 원칙을 중시하는 것을 중요시 하기 때문에 누구보다 회사생활을 잘 해내요.<br>부사수가 있는데도 누구 시키는 것보다 혼자 하는게 편해서 일을 다 떠맡곤 해요.',
      resultDesc: [
        '의젓한 성격으로 장남 장녀 같다는 소리를 많이 들어요.',
        '학교에서 예쁨 받았을 성격이에요.',
        '충동적, 즉흥적으로 뭔가를 하는 것을 좋아하지 않아요.',
        '대중적인 취향을 가지고 있어요.',
        '거짓말하는 것, 시간 약속 어기는 것을 굉장히 싫어해요.',
        '조직적인 환경을 선호하며 규칙과 체계를 중요시해요.',
        '연애를 할 땐 책임감과 성실함으로 상대방에게 안정감을 줘요.',
        '실수를 하면 참지 못하고 즉각 수정하고 싶어요.',
        '문제를 해결할 땐 과거의 경험을 토대로 해요.',
        '친해지면 엄청 능글맞고 재밌어요.',
        '외로움을 잘 타지 않아요.'
      ],
      good: "'친화력 갑 주인공 단짝친구'<br>'폼생폼사 탐정'",
      bad: "'다정다감한 상담선생님'<br>'자기애 충만 기자'"
    },
  }
]