const result = {
  ESFP: {
    h3: "'친화력 갑 주인공 단짝친구 캐릭터'",
    p: '주로 "학원물 영화"에서 많이 등장해요.<br>온 세상 사람들이 모두 내 친구에요.<br>주변 사람들에게 관심이 많고 말도 많은 주인공의 정보통 역할.<br>가끔은 너무 시끄러워서 주인공이 골치 아파 하지만,<br>분위기 메이커 역할을 하기 때문에 미워할 수 없는 캐릭터.'
  },
  ESTP: {
    h3: "'폼생폼사 탐정'",
    p: '주로 형사물에 등장하는 멋에 죽고 멋에 사는 탐정 캐릭터예요.<br>본인한테 재미 없는 사건은 맡으려 하지 않고, 멋을 중요시하기 때문에 항상 잘 꾸미고 다녀요.<br>우유부단하고 느린 동료를 보면 속이 터져서, 혼자 사건을 해결하는 경우가 많아요.<br>관찰력이 좋고, 사람 파악을 잘하는 특유의 능력으로 인정 받아요.'
  },
  ENTP: {
    h3: "'내가 최고 법조인 캐릭터'",
    p: '주로 법정 드라마에 나오는 자신감 넘치는 캐릭터에요.<br>기본적으로 자기 확신이 강하고 실제로도 잘하는 것이 많은 만능캐예요.<br>주변 사람들에게 관심이 많고 말도 많은 주인공의 정보통 역할.<br>가끔은 너무 시끄러워서 주인공이 골치 아파 하지만,<br>분위기 메이커 역할을 하기 때문에 미워할 수 없는 캐릭터.'
  }
};

