const detail = [
  {
    ESFP: {
      h3: "'친화력 갑 주인공 단짝친구 캐릭터'",
      p: '주로 "학원물 영화"에서 많이 등장해요.<br>온 세상 사람들이 모두 내 친구에요.<br>주변 사람들에게 관심이 많고 말도 많은 주인공의 정보통 역할.<br>가끔은 너무 시끄러워서 주인공이 골치 아파 하지만,<br>분위기 메이커 역할을 하기 때문에 미워할 수 없는 캐릭터.'
    },
  },
  {
    ESTP: {
      h3: "'폼생폼사 탐정'",
      p: '주로 형사물에 등장하는 멋에 죽고 멋에 사는 탐정 캐릭터예요.<br>본인한테 재미 없는 사건은 맡으려 하지 않고, 멋을 중요시하기 때문에 항상 잘 꾸미고 다녀요.<br>우유부단하고 느린 동료를 보면 속이 터져서, 혼자 사건을 해결하는 경우가 많아요.<br>관찰력이 좋고, 사람 파악을 잘하는 특유의 능력으로 인정 받아요.'
    },
  },
  {
    ENTP: {
      h3: "'내가 최고 법조인 캐릭터'",
      p: '주로 법정 드라마에 나오는 자신감 넘치는 캐릭터에요.<br>기본적으로 자기 확신이 강하고 실제로도 잘하는 것이 많은 만능캐예요.<br>주변 사람들에게 관심이 많고 말도 많은 주인공의 정보통 역할.<br>가끔은 너무 시끄러워서 주인공이 골치 아파 하지만,<br>분위기 메이커 역할을 하기 때문에 미워할 수 없는 캐릭터.'
    },
  },
  {
    ENFP: {
      h3: "'동영상 크리에이터'",
      p: '로맨틱 코미디 장르의 영화에 등장할 것 같은 발랄한 캐릭터에요.<br>엄청난 수다쟁이로, 은근한 개그캐로 자주 등장할 것 같아요.<br>가끔은 과한 텐션 때문에 주변 인물들이 힘들어하지만, 늘 긍정적이고 밝은 모습으로 분위기를 띄워주기 때문에 결국엔 좋아할 수밖에 없어요.'
    },
  },
  {
    ENFJ: {
      h3: "'인기만점 선생님'",
      p: '학원물에서 등장하는 인기 많은 선생님 캐릭터에요.<br>본업도 잘하고 성격도 좋아서 학생들뿐만 아니라 동료 선생님들 사이에서도 평판이 좋아요.'
    },
  },
  {
    ESFJ: {
      h3: "'팔방미인 전교회장'",
      p: '학원물에서 등장하는 능력치 만렙 전교회장 캐릭터에요.<br>운동이면 운동, 공부면 공부 등 두루두루 다 잘해요.<br>모두를 구해야 한다는 사명감에 사로잡혀 있는 오지라퍼라 부담스러울 때도 있지만, 친구들이 무슨 일이 생기면 제일 먼저 나서서 돕는 모습에 주변 사람들이 감동받아요.'
    },
  },
  {
    ENTJ: {
      h3: "'내가 최고 워커홀릭 메인 셰프'",
      p: '특유의 추진력과 카리스마를 지닌 메인 셰프 캐릭터에요.<br>한없이 냉철해 보이지만 내 사람들에게는 관대하고 따뜻해서 함께 일하는 사람들에게 존경받아요.'
    },
  },
  {
    ENTJ: {
      h3: "'젊꼰 팀장님 캐릭터'",
      p: '오피스물에 등장하는 일을 똑 부러지게 잘하는 젊은 팀장님 캐릭터에요.<br>나이는 젊지만 독하리만큼 일을 잘 해내서 초고속 승진했어요.<br>업무에 대한 이야기를 할 때 가장 눈이 반짝반짝하고, 일을 완벽히 잘 해냈을 때가 가장 짜릿하고 기분 좋아요.'
    },
  },
  {
    INFP: {
      h3: "'고군분투 사회 초년생(인턴)'",
      p: '성장물 드라마나 영화에 등장하는 사회 초년생 캐릭터예요.<br>위계질서가 강한 회사 생활에 적응하기 어려워하고, 스트레스를 많이 받아요.<br>하지만 특유의 강한 책임감으로 묵묵히 맡은 일을 해내는 모습을 보면 같이 응원하게 되는 캐릭터예요.'
    },
  },
  {
    ISFP: {
      h3: "'자유로운 영혼 목공방 사장님'",
      p: '로맨스 코미디 장르에서 등장하는 순둥순둥 순두부 같은 캐릭터예요.<br>순수한 아이 같은 이 캐릭터는 항상 물 흐르듯이 살고 매사에 걱정이 없어 보이지만, 알고 보면 나름의 고충은 가지고 있어요.<br>구김살 없는 모습으로 주변 사람들을 편하게 해주고, 인기가 좋아요.'
    },
  },
  {
    INFJ: {
      h3: "'다정다감한 상담선생님'",
      p: ''
    },
  },
  {
    ISFJ: {
      h3: "'소확행 도서관 사서'",
      p: '세심하고 배려심 넘치는 성격으로 손님들이 필요로 하는 것을 잘 캐치해요.<br>반복되는 일상 속에서 소소한 행복을 즐기며 살아요.'
    },
  },
  {
    INTP: {
      h3: "'자발적 아싸 약사'",
      p: '논리적이고 지적인 모습이 매력적인 캐릭터에요.<br>뭐든 혼자 하는 게 편해서 자발적으로 혼자 지내요.<br>과묵한 편이라 친해지기 어려워 보이지만 알고 보면 털털하고 좋아하는 사람에겐 헌신적이에요.'
    },
  },
  {
    ISTP: {
      h3: "'마이웨이 복서'",
      p: '액션 영화에 등장할 것 같은 복서 캐릭터예요.<br>다른 사람에게 무관심하고 본인의 일에만 몰두하는 모습이 냉철해 보일 수 있지만, 누구보다 본업을 잘 하는 모습이 매력적이에요.<br>평소엔 차가운 이미지이지만 자기 사람에게는 장난도 잘 치고  개구쟁이같이 행동하기도 해요.'
    },
  },
  {
    INTJ: {
      h3: "'자기애 충만 기자'",
      p: ''
    },
  },
  {
    ISTJ: {
      h3: "'일잘러 대리님'",
      p: '책임감이 강하고 원칙을 중시하는 것을 중요시 하기 때문에 누구보다 회사생활을 잘 해내요.<br>부사수가 있는데도 누구 시키는 것보다 혼자 하는게 편해서 일을 다 떠맡곤 해요.'
    },
  }
]